Ontaelio/STM32F103-Ublink-framework/stm32f103_dma.cpp
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_SPI1_(SPI_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem(dir=1)
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint8_t* src, spi2_slave targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 5-1; //Subtract one to use later with CCR register; channel 5 (SPI2 TX)
	targ.DMATXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_SPI2_(SPI_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem(dir=1)
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(spi1_slave src, uint16_t* targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 2-1; //Subtract one to use later with CCR register; channel 2 (SPI1 RX)
	src.DMARXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_SPI1_(SPI_DR)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC);
}

void dma1::init(spi2_slave src, uint16_t* targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 4-1; //Subtract one to use later with CCR register; channel 4 (SPI2 RX)
	src.DMARXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_SPI2_(SPI_DR)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC);
}

void dma1::init(spi1_slave src, uint8_t* targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 2-1; //Subtract one to use later with CCR register; channel 2 (SPI1 RX)
	src.DMARXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_SPI1_(SPI_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC);
}

void dma1::init(spi2_slave src, uint8_t* targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 4-1; //Subtract one to use later with CCR register; channel 4 (SPI2 RX)
	src.DMARXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_SPI2_(SPI_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC);
}

void dma1::init(uint8_t* src, i2c1_slave targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 6-1; //Subtract one to use later with CCR register; channel 6 (I2C1 TX)
	targ.DMAenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_I2C1_(I2C_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem(dir=1)
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint8_t* src, i2c2_slave targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 4-1; //Subtract one to use later with CCR register; channel 4 (I2C2 TX)
	targ.DMAenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_I2C2_(I2C_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem(dir=1)
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(i2c1_slave src, uint8_t* targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 7-1; //Subtract one to use later with CCR register; channel 7 (I2C1 RX)
	src.DMAenable();
	}
	else setDMAtimerChannel(cha);

	src.LASTset(); //last byte triggers NACK

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_I2C1_(I2C_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC);
}

void dma1::init(i2c2_slave src, uint8_t* targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 5-1; //Subtract one to use later with CCR register; channel 5 (I2C2 RX)
	src.DMAenable();
	}
	else setDMAtimerChannel(cha);

	src.LASTset(); //last byte triggers NACK

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_I2C2_(I2C_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC);
}

void dma1::init(uint8_t* src, usart1 targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 4-1; //Subtract one to use later with CCR register; channel 4 (TX)
	targ.DMATXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_USART1_(USART_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint8_t* src, usart2 targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 7-1; //Subtract one to use later with CCR register; channel 7 (TX)
	targ.DMATXenable();
	}
	else setDMAtimerChannel(cha);

