Ontaelio/STM32F103-Ublink-framework/stm32f103_dma.cpp
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_USART2_(USART_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint8_t* src, usart3 targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 2-1; //Subtract one to use later with CCR register; channel 2 (TX)
	targ.DMATXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_USART3_(USART_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(usart1 src, uint8_t* targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 5-1; //Subtract one to use later with CCR register; channel 5 (RX)
	src.DMARXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_USART1_(USART_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments,
	//_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC);
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | MSIZE8_INCR | PSIZE8);
}

void dma1::init(usart2 src, uint8_t* targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 6-1; //Subtract one to use later with CCR register; channel 6 (RX)
	src.DMARXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_USART2_(USART_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC);
}

void dma1::init(usart3 src, uint8_t* targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 3-1; //Subtract one to use later with CCR register; channel 3 (RX)
	src.DMARXenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_USART3_(USART_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC);
}

void dma1::init(analog_cont src, uint16_t targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 1-1; //Subtract one to use later with CCR register; channel 1 (ADC)
	src.DMAenable();
	}
	else setDMAtimerChannel(cha);

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_ADC1_(ADC_DR)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC);
}

void dma1::init(analog_cont src1, analog_cont src2, uint32_t targ, uint16_t pri)
{
	if (cha == 0)
	{
	cha = 1-1; //Subtract one to use later with CCR register; channel 1 (ADC)
	src1.DMAenable();
	}
	else setDMAtimerChannel(cha);

	adc_dualMode(7); // fast interleaved mode; max conversion time is 7 cycles

	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)targ; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_ADC1_(ADC_DR)); //set peripheral address
	//priority, 32 bit mem, 32 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE32 | DMA_PSIZE32 | DMA_CCR_MINC);
}

void dma1::init(usart1 src, spi1_slave targ, uint16_t pri)
{
	cha = 5-1; // usart1 RX channel 5
	src.DMARXenable();
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)&(_SPI1_(SPI_DR)); //set 'memory' address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_ADC1_(ADC_DR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments,
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE8 | DMA_PSIZE8 | DMA_CCR_MINC);
}

void dma1::init(uint16_t* src, tim1_pwm targ, uint8_t uedma, uint16_t pri)
{
	switch (targ.channel)
	{
		case 1: cha = 2-1; break;
		//case 2: cha = 2-1; break; // no DMA for ch2
		case 3: cha = 6-1; break;
		case 4: cha = 4-1; break;
		default: break;
	}
	//CCDS assures the DMA request is sent on update, but the DMA channel remains CC-connected
	if (uedma) _TIM1_(TIMX_CR2) |= TIMX_CR2_CCDS; else _TIM1_(TIMX_CR2) &= ~TIMX_CR2_CCDS;
	targ.DMAenable(); // channel dma enable
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_TIM1_(targ.ch_addr)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, tim2_pwm targ, uint8_t uedma, uint16_t pri)
{
	switch (targ.channel)
	{
		case 1: cha = 5-1; break;
		case 2: cha = 7-1; break;
		case 3: cha = 1-1; break;
		case 4: cha = 7-1; break;
		default: break;
	}
	if (uedma) _TIM2_(TIMX_CR2) |= TIMX_CR2_CCDS; else _TIM2_(TIMX_CR2) &= ~TIMX_CR2_CCDS;
	targ.DMAenable(); // channel dma enable
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_TIM2_(targ.ch_addr)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, tim3_pwm targ, uint8_t uedma, uint16_t pri)
{
	switch (targ.channel)
	{
		case 6: cha = 2-1; break;
		//case 2: cha = 2-1; break; // no DMA for ch2
		case 3: cha = 2-1; break;
		case 4: cha = 3-1; break;
		default: break;
	}
	if (uedma) _TIM3_(TIMX_CR2) |= TIMX_CR2_CCDS; else _TIM3_(TIMX_CR2) &= ~TIMX_CR2_CCDS;
	targ.DMAenable(); // channel dma enable
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_TIM3_(targ.ch_addr)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, tim4_pwm targ, uint8_t uedma, uint16_t pri)
{
	switch (targ.channel)
	{
		case 1: cha = 1-1; break;
		case 2: cha = 4-1; break;
		case 3: cha = 5-1; break;
		//case 4: cha = 4-1; break; // no DMA for ch4
		default: break;
	}
	if (uedma) _TIM4_(TIMX_CR2) |= TIMX_CR2_CCDS; else _TIM4_(TIMX_CR2) &= ~TIMX_CR2_CCDS;
	targ.DMAenable(); // channel dma enable
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_TIM4_(targ.ch_addr)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, timer1 targ, uint8_t numofch, uint16_t pri)
{
	cha = 5-1;
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable

	targ.DMAburst(numofch); //num of data to transfer in one burst
	targ.DMAbase(13); //CCR1
	targ.DMAUPenable();

