Ontaelio/STM32F103-Ublink-framework/stm32f103_dma.cpp
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_TIM1_(TIMX_DMAR)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, timer2 targ, uint8_t numofch, uint16_t pri)
{
	cha = 2-1;
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable

	targ.DMAburst(numofch); //num of data to transfer in one burst
	targ.DMAbase(13); //CCR1
	targ.DMAUPenable();

	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_TIM2_(TIMX_DMAR)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, timer3 targ, uint8_t numofch, uint16_t pri)
{
	cha = 3-1;
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable

	targ.DMAburst(numofch); //num of data to transfer in one burst
	targ.DMAbase(13); //CCR1
	targ.DMAUPenable();

	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_TIM3_(TIMX_DMAR)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, timer4 targ, uint8_t numofch, uint16_t pri)
{
	cha = 7-1;
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable

	targ.DMAburst(numofch); //num of data to transfer in one burst
	targ.DMAbase(13); //CCR1
	targ.DMAUPenable();

	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_TIM4_(TIMX_DMAR)); //set peripheral address
	//priority, 16 bit mem, 16 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE16 | DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, gpioA targ, int16_t pri)
{
	setDMAtimerChannel(cha);
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_GPIOA_(GPIOX_ODR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE32| DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, gpioB targ, int16_t pri)
{
	setDMAtimerChannel(cha);
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_GPIOB_(GPIOX_ODR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE32| DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint16_t* src, gpioC targ, int16_t pri)
{
	setDMAtimerChannel(cha);
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_GPIOC_(GPIOX_ODR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE16 | DMA_PSIZE32| DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint32_t* src, gpioA targ, int16_t pri)
{
	setDMAtimerChannel(cha);
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_GPIOA_(GPIOX_BSRR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE32 | DMA_PSIZE32| DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint32_t* src, gpioB targ, int16_t pri)
{
	setDMAtimerChannel(cha);
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_GPIOB_(GPIOX_BSRR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE32 | DMA_PSIZE32| DMA_CCR_MINC | DMA_CCR_DIR);
}

void dma1::init(uint32_t* src, gpioC targ, int16_t pri)
{
	setDMAtimerChannel(cha);
	_DMA1_(DMA_CCR + cha*20) &= ~DMA_CCR_EN; //disable
	_DMA1_(DMA_CMAR + cha*20) = (uint32_t)src; //set memory address
	_DMA1_(DMA_CPAR + cha*20) = (uint32_t)&(_GPIOC_(GPIOX_BSRR)); //set peripheral address
	//priority, 8 bit mem, 8 bit periph, memory increments, from mem
	_DMA1_(DMA_CCR + cha*20) = (uint16_t)(pri | DMA_MSIZE32 | DMA_PSIZE32| DMA_CCR_MINC | DMA_CCR_DIR);
}
